In [11]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from unicodedata import normalize

table_MN = pd.read_html('https://en.wikipedia.org/wiki/Minnesota')
print(f'Total tables:{len(table_MN)}')
df = table_MN[0]
print(df.head())
print(df.info())

Total tables:29
                                           Minnesota  \
0                                              State
1                                 State of Minnesota
2  .mw-parser-output .ib-settlement-cols{text-ali...
3  Nickname(s): Land of 10,000 Lakes;North Star S...
4  Motto(s): L'Étoile du Nord (French: The Star o...

                                         Minnesota.1
0                                              State
1                                 State of Minnesota
2  .mw-parser-output .ib-settlement-cols{text-ali...
3  Nickname(s): Land of 10,000 Lakes;North Star S...
4  Motto(s): L'Étoile du Nord (French: The Star o...
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Minnesota    52 non-null     object
 1   Minnesota.1  52 non-null     object
dtypes: object(2)
memory usage: 960.0+ bytes
None

In [10]:
table_MN = pd.read_html('https://en.wikipedia.org/wiki/Minnesota', match='Election results from statewide races')
print(len(table_MN))
print(table_MN)

1
[    Year     Office    GOP    DFL Others
0   2020  President  45.3%  52.4%   2.3%
1   2020    Senator  43.5%  48.8%   7.7%
2   2018   Governor  42.4%  53.9%   3.7%
3   2018    Senator  36.2%  60.3%   3.4%
4   2018    Senator  42.4%  53.0%   4.6%
5   2016  President  44.9%  46.4%   8.6%
6   2014   Governor  44.5%  50.1%   5.4%
7   2014    Senator  42.9%  53.2%   3.9%
8   2012  President  45.1%  52.8%   2.1%
9   2012    Senator  30.6%  65.3%   4.1%
10  2010   Governor  43.2%  43.7%  13.1%
11  2008  President  43.8%  54.1%   2.1%
12  2008    Senator  42.0%  42.0%  16.0%
13  2006   Governor  46.7%  45.7%   7.6%
14  2006    Senator  37.9%  58.1%   4.0%
15  2004  President  47.6%  51.1%   1.3%
16  2002   Governor  44.4%  33.5%  22.1%
17  2002    Senator  49.5%  47.3%   1.0%
18  2000  President  45.5%  47.9%   6.6%
19  2000    Senator  43.3%  48.8%   7.9%
20  1998   Governor  34.3%  28.1%  37.6%
21  1996  President  35.0%  51.1%  13.9%
22  1996    Senator  41.3%  50.3%   8.4%
23  1994   Governor  63.3%  34.1%   2.6%
24  1994    Senator  49.1%  44.1%   6.8%
25  1992  President  31.9%  43.5%  24.6%]

In [12]:
import pandas as pd
data = {
"도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
"연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
"인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
"지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
print(df1)

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [13]:
#행 인덱스 인수로는 "도시", 열 인덱스 인수로는 "연도", 데이터 이름으로 "인구"를 입력
pivot1 = df1.pivot("도시", "연도", "인구")
print(pivot1)
print(pivot1.columns)
print(pivot1.index)

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0
Index(['2005', '2010', '2015'], dtype='object', name='연도')
Index(['부산', '서울', '인천'], dtype='object', name='도시')

In [14]:
#피봇테이블은 set_index 명령과 unstack 명령을 사용해서 만들 수도 있다.
print(df1.set_index(["도시", "연도"])[["인구"]].unstack())

           인구
연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [15]:
pivot2 = pivot1.copy()
print(pivot2)

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [16]:
print(pivot2.columns)
print(pivot2.index)

Index(['2005', '2010', '2015'], dtype='object', name='연도')
Index(['부산', '서울', '인천'], dtype='object', name='도시')

In [18]:
pivot2.reset_index(level-0,inplace=True)
print(pivot2)

NameError: name 'level' is not defined

In [20]:
try:
    df1.pivot("지역","연도","인구")
except ValueError as e :
    print("ValueError")

ValueError

In [26]:
import pandas as pd

data = pd.DataFrame({'cust_id': ['c1', 'c1', 'c1', 'c2', 'c2', 'c2', 'c3', 'c3', 'c3'],
                  'prod_cd': ['p1', 'p2', 'p3', 'p1', 'p2', 'p3', 'p1', 'p2', 'p3'], 
                  'grade' : ['A', 'A', 'A', 'A', 'A', 'A', 'B', 'B', 'B'], 
                  'pch_amt': [30, 10, 0, 40, 15, 30, 0, 0, 10]})

print(data.info())
print(data)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   cust_id  9 non-null      object
 1   prod_cd  9 non-null      object
 2   grade    9 non-null      object
 3   pch_amt  9 non-null      int64
dtypes: int64(1), object(3)
memory usage: 416.0+ bytes
None
  cust_id prod_cd grade  pch_amt
0      c1      p1     A       30
1      c1      p2     A       10
2      c1      p3     A        0
3      c2      p1     A       40
4      c2      p2     A       15
5      c2      p3     A       30
6      c3      p1     B        0
7      c3      p2     B        0
8      c3      p3     B       10

In [27]:
pd.pivot_table(data, index=['cust_id','grade'], columns='prod_cd', values='pch_amt')

prod_cd        p1  p2  p3
cust_id grade
c1      A      30  10   0
c2      A      40  15  30
c3      B       0   0  10

In [30]:
data = pd.DataFrame({'cust_ID' : ['C_001', 'C_001', 'C_002', 'C_002'], 'prd_CD' : ['P_001', 'P_002', 'P_001', 'P_002'],'pch_cnt' : [1, 2, 3, 4],'pch_amt' : [100, 200, 300, 400]})
print(data.info())
print(data)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   cust_ID  4 non-null      object
 1   prd_CD   4 non-null      object
 2   pch_cnt  4 non-null      int64
 3   pch_amt  4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes
None
  cust_ID prd_CD  pch_cnt  pch_amt
0   C_001  P_001        1      100
1   C_001  P_002        2      200
2   C_002  P_001        3      300
3   C_002  P_002        4      400

In [32]:
pd.melt(data, id_vars=['cust_ID', 'prd_CD'])

  cust_ID prd_CD variable  value
0   C_001  P_001  pch_cnt      1
1   C_001  P_002  pch_cnt      2
2   C_002  P_001  pch_cnt      3
3   C_002  P_002  pch_cnt      4
4   C_001  P_001  pch_amt    100
5   C_001  P_002  pch_amt    200
6   C_002  P_001  pch_amt    300
7   C_002  P_002  pch_amt    400

In [33]:
pd.melt(data, id_vars=['cust_ID', 'prd_CD'], var_name='pch_CD', value_name='pch_value')

  cust_ID prd_CD   pch_CD  pch_value
0   C_001  P_001  pch_cnt          1
1   C_001  P_002  pch_cnt          2
2   C_002  P_001  pch_cnt          3
3   C_002  P_002  pch_cnt          4
4   C_001  P_001  pch_amt        100
5   C_001  P_002  pch_amt        200
6   C_002  P_001  pch_amt        300
7   C_002  P_002  pch_amt        400

In [35]:
data_melt = pd.melt(data, id_vars=['cust_ID', 'prd_CD'], var_name='pch_CD', value_name='pch_value')
print(data_melt.index)
print(data_melt.columns)

RangeIndex(start=0, stop=8, step=1)
Index(['cust_ID', 'prd_CD', 'pch_CD', 'pch_value'], dtype='object')

In [36]:
data_melt_pivot = pd.pivot_table(data_melt, index=['cust_ID', 'prd_CD'], columns='pch_CD', values='pch_value', aggfunc=np.mean)
print(data_melt_pivot.index)

MultiIndex([('C_001', 'P_001'),
            ('C_001', 'P_002'),
            ('C_002', 'P_001'),
            ('C_002', 'P_002')],
           names=['cust_ID', 'prd_CD'])

In [37]:
print(data_melt_pivot.columns)

Index(['pch_amt', 'pch_cnt'], dtype='object', name='pch_CD')

In [38]:
data_melt_pivot = pd.pivot_table(data_melt, index=['cust_ID', 'prd_CD'], columns='pch_CD', values='pch_value', aggfunc=np.mean)

In [44]:
sub= pd.read_csv('C:/Users/Administrator/Jupyter/subway.csv', encoding='cp949')


sub.groupby(sub['노선번호']).mean()['승차']
sub.groupby(sub['노선번호'])['승차'].mean()

노선번호
line_1     483346.70
line_2    2369694.25
line_3     824213.45
line_4     990538.80
line_5     526479.85
line_6     990538.80
line_7     978634.95
line_8     946210.60
Name: 승차, dtype: float64

In [45]:
#

sub.iloc[:,[0,2,3]].groupby('노선번호').agg(['sum','mean'])

              승차                    하차
             sum        mean       sum        mean
노선번호
line_1   9666934   483346.70   9430846   471542.30
line_2  47393885  2369694.25  47983161  2399158.05
line_3  16484269   824213.45  16555337   827766.85
line_4  19810776   990538.80  20053934  1002696.70
line_5  10529597   526479.85  10650666   532533.30
line_6  19810776   990538.80  20053934  1002696.70
line_7  19572699   978634.95  20642314  1032115.70
line_8  18924212   946210.60  17843163   892158.15

In [46]:
# 노선번호별 승차 데이터 수 확인

sub.groupby(sub['노선번호'])['승차'].count()
sub.groupby(sub['노선번호'])['승차'].size()

노선번호
line_1    20
line_2    20
line_3    20
line_4    20
line_5    20
line_6    20
line_7    20
line_8    20
Name: 승차, dtype: int64

In [47]:
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9], [40, 50, 60], [23, 35, 37]]),
index= [2.5, 12.6, 4.8, 4.8, 2.5],
columns=[48, 49, 50])
display(df)
df = df.reset_index()
display(df)
df = df.drop_duplicates(subset='index', keep='last').set_index('index')
display(df)

      48  49  50
2.5    1   2   3
12.6   4   5   6
4.8    7   8   9
4.8   40  50  60
2.5   23  35  37

   index  48  49  50
0    2.5   1   2   3
1   12.6   4   5   6
2    4.8   7   8   9
3    4.8  40  50  60
4    2.5  23  35  37

       48  49  50
index
12.6    4   5   6
4.8    40  50  60
2.5    23  35  37

In [49]:
ebola = pd.read_csv('C:/Users/Administrator/Jupyter/country_timeseries.csv')
print(ebola.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    object
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
dtypes: float64(16), int64(1), object(1)
memory usage: 17.3+ KB
None

In [50]:
ebola['date_dt']=pd.to_datetime(ebola.Date)
print(ebola.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 19 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    object
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
 18  date_dt              122 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(16), int64(1), object(1)
memory usage: 18.2+ KB
None